PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16f1613.inc
;==========================================================================
;
;       Configuration Bits
;
;   NAME            Address
;   CONFIG1           8007h
;   CONFIG2           8008h
;   CONFIG3           8009h
;
;==========================================================================

; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1         EQU  H'8007'
_CONFIG2         EQU  H'8008'
_CONFIG3         EQU  H'8009'

;----- CONFIG1 Options --------------------------------------------------
_FOSC_INTOSC     EQU  H'3FFC'    ; INTOSC oscillator: I/O function on CLKIN pin
_FOSC_ECL        EQU  H'3FFD'    ; ECL, External Clock, Low Power Mode (0-0.5 MHz): device clock supplied to CLKIN pins
_FOSC_ECM        EQU  H'3FFE'    ; ECM, External Clock, Medium Power Mode (0.5-4 MHz): device clock supplied to CLKIN pins
_FOSC_ECH        EQU  H'3FFF'    ; ECH, External Clock, High Power Mode (4-20 MHz): device clock supplied to CLKIN pins

_PWRTE_ON        EQU  H'3FDF'    ; PWRT enabled
_PWRTE_OFF       EQU  H'3FFF'    ; PWRT disabled

_MCLRE_OFF       EQU  H'3FBF'    ; MCLR/VPP pin function is digital input
_MCLRE_ON        EQU  H'3FFF'    ; MCLR/VPP pin function is MCLR

_CP_ON           EQU  H'3F7F'    ; Program memory code protection is enabled
_CP_OFF          EQU  H'3FFF'    ; Program memory code protection is disabled

_BOREN_OFF       EQU  H'39FF'    ; Brown-out Reset disabled
_BOREN_SBODEN    EQU  H'3BFF'    ; Brown-out Reset controlled by the SBOREN bit in the BORCON register
_BOREN_NSLEEP    EQU  H'3DFF'    ; Brown-out Reset enabled while running and disabled in Sleep
_BOREN_ON        EQU  H'3FFF'    ; Brown-out Reset enabled

_CLKOUTEN_ON     EQU  H'37FF'    ; CLKOUT function is enabled on the CLKOUT pin
_CLKOUTEN_OFF    EQU  H'3FFF'    ; CLKOUT function is disabled. I/O or oscillator function on the CLKOUT pin

;----- CONFIG2 Options --------------------------------------------------
_WRT_ALL         EQU  H'3FFC'    ; 000h to 1FFFh write protected, no addresses may be modified by EECON control
_WRT_HALF        EQU  H'3FFD'    ; 000h to FFFh write protected, 1000h to 1FFFh may be modified by EECON control
_WRT_BOOT        EQU  H'3FFE'    ; 000h to 1FFh write protected, 200h to 1FFFh may be modified by EECON control
_WRT_OFF         EQU  H'3FFF'    ; Write protection off

_ZCD_ON          EQU  H'3F7F'    ; ZCD always enabled
_ZCD_OFF         EQU  H'3FFF'    ; ZCD disable.  ZCD can be enabled by setting the ZCDSEN bit of ZCDCON

_PLLEN_OFF       EQU  H'3EFF'    ; 4x PLL is enabled when software sets the SPLLEN bit
_PLLEN_ON        EQU  H'3FFF'    ; 4x PLL is always enabled

_STVREN_OFF      EQU  H'3DFF'    ; Stack Overflow or Underflow will not cause a Reset
_STVREN_ON       EQU  H'3FFF'    ; Stack Overflow or Underflow will cause a Reset

_BORV_HI         EQU  H'3BFF'    ; Brown-out Reset Voltage (Vbor), high trip point selected.
_BORV_LO         EQU  H'3FFF'    ; Brown-out Reset Voltage (Vbor), low trip point selected.

_LPBOR_ON        EQU  H'37FF'    ; Low-Power BOR is enabled
_LPBOR_OFF       EQU  H'3FFF'    ; Low-Power BOR is disabled

;;;; Begin: Added in gputils
_DEBUG_ON        EQU  H'2FFF'    ; In-Circuit Debugger enabled, ICSPCLK and ICSPDAT are dedicated to the debugger.
_DEBUG_OFF       EQU  H'3FFF'    ; In-Circuit Debugger disabled, ICSPCLK and ICSPDAT are general purpose I/O pins.

;;;; End: Added in gputils
_LVP_OFF         EQU  H'1FFF'    ; High-voltage on MCLR/VPP must be used for programming
_LVP_ON          EQU  H'3FFF'    ; Low-voltage programming enabled

;----- CONFIG3 Options --------------------------------------------------
_WDTCPS_WDTCPS0  EQU  H'3FE0'    ; 1:32 (1 ms period)
_WDTCPS_WDTCPS1  EQU  H'3FE1'    ; 1:64 (2 ms period)
_WDTCPS_WDTCPS2  EQU  H'3FE2'    ; 1:128 (4 ms period)
_WDTCPS_WDTCPS3  EQU  H'3FE3'    ; 1:256 (8 ms period)
_WDTCPS_WDTCPS4  EQU  H'3FE4'    ; 1:512 (16 ms period)
_WDTCPS_WDTCPS5  EQU  H'3FE5'    ; 1:1024 (32 ms period)
_WDTCPS_WDTCPS6  EQU  H'3FE6'    ; 1:2048 (64 ms period)
_WDTCPS_WDTCPS7  EQU  H'3FE7'    ; 1:4096 (128 ms period)
_WDTCPS_WDTCPS8  EQU  H'3FE8'    ; 1:8192 (256 ms period)
_WDTCPS_WDTCPS9  EQU  H'3FE9'    ; 1:16384 (512 ms period)
_WDTCPS_WDTCPSA  EQU  H'3FEA'    ; 1:32768 (1 s period)
_WDTCPS_WDTCPSB  EQU  H'3FEB'    ; 1:65536 (2 s period)
_WDTCPS_WDTCPSC  EQU  H'3FEC'    ; 1:131072 (4 s period)
_WDTCPS_WDTCPSD  EQU  H'3FED'    ; 1:262144 (8 s period)
_WDTCPS_WDTCPSE  EQU  H'3FEE'    ; 1:524299 (16 s period)
_WDTCPS_WDTCPSF  EQU  H'3FEF'    ; 1:1048576 (32 s period)
_WDTCPS_WDTCPS10 EQU  H'3FF0'    ; 1:2097152 (64 s period)
_WDTCPS_WDTCPS11 EQU  H'3FF1'    ; 1:4194304 (128 s period)
_WDTCPS_WDTCPS12 EQU  H'3FF2'    ; 1:8388608 (256 s period)
_WDTCPS_WDTCPS1F EQU  H'3FFF'    ; Software Control (WDTPS)

_WDTE_OFF        EQU  H'3F9F'    ; WDT disabled
_WDTE_SWDTEN     EQU  H'3FBF'    ; WDT controlled by the SWDTEN bit in the WDTCON register
_WDTE_NSLEEP     EQU  H'3FDF'    ; WDT enabled while running and disabled in Sleep
_WDTE_ON         EQU  H'3FFF'    ; WDT enabled

_WDTCWS_WDTCWS125 EQU  H'38FF'    ; 12.5 percent window open time
_WDTCWS_WDTCWS25 EQU  H'39FF'    ; 25 percent window open time
_WDTCWS_WDTCWS375 EQU  H'3AFF'    ; 37.5 percent window open time
_WDTCWS_WDTCWS50 EQU  H'3BFF'    ; 50 percent window open time
_WDTCWS_WDTCWS625 EQU  H'3CFF'    ; 62.5 percent window open time
_WDTCWS_WDTCWS75 EQU  H'3DFF'    ; 75 percent window open time
_WDTCWS_WDTCWS100 EQU  H'3EFF'    ; 100 percent window open time (Legacy WDT) 
_WDTCWS_WDTCWSSW EQU  H'3FFF'    ; Software WDT window size control (WDTWS bits)

_WDTCCS_LFINTOSC EQU  H'7FF'    ; 31.0kHz LFINTOSC
_WDTCCS_MFINTOSC EQU  H'FFF'    ; 31.25 kHz HFINTOSC (MFINTOSC)
_WDTCCS_SWC      EQU  H'3FFF'    ; Software control, controlled by WDTCS bits

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'8006'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'8000'
_IDLOC1          EQU  H'8001'
_IDLOC2          EQU  H'8002'
_IDLOC3          EQU  H'8003'

        LIST
